> Hi @andersthorbeck Thanks for reporting the issue.
> 
> To you question: The application itself will not be deleted (see your output) only the `inline` password definition.

@HappyTobi Indeed, I was not worried about the deletion of the application itself, but of its password, which may be used in a number of different contexts to authenticate as the application and thus acquire the required access to perform whichever Azure actions the application (or corresponding service principal) has been granted roles for.

> The `azuread_application_password` is independent from the inline one so you have 2 secrets and the `external` one is not touched.
> 
> The password resources / secrets are handled by the "keyId". You can see the `keyId` in your terraform state file and at `Microsoft Entra Id` as `Secret ID`

You say that the `azuread_application.my_application.password` password and `azuread_application_password.my_application` password are different. Judging by the fact that it seems applications _can_ have multiple passwords, I guess it's theoretically true that they _could_ be different.

However, our experience when merging the `tfupdate` pull request in one of our Terraform repositories, which changed only the azuread version from `3.0.2` to `3.1.0`, was that both `azuread_application.my_application.password` and `azuread_application_password.my_application` in fact referenced the _same_ password. 

This was implied by the `terraform plan` of the PR bumping `azuread` to `3.1.0`, to delete a `password` which had never been explicitly defined in the `azuread_application` resource:
```terraform
  # azuread_application.my_application will be updated in-place
  ~ resource "azuread_application" "my_application" {
        id                             = "/applications/12345678-abcd-1234-1234-1234567890ab"
        tags                           = []
        # (25 unchanged attributes hidden)

      - password {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (6 unchanged blocks hidden)
    }
```
and the corresponding `terraform apply` run log:
```
module.my_application.azuread_application.main: Modifying... [id=/applications/12345678-abcd-1234-1234-1234567890ab]
module.my_application.azuread_application.main: Modifications complete after 26s [id=/applications/12345678-abcd-1234-1234-1234567890ab]
```

which was then followed, in the subsequent Terraform plan (from the next PR) of the same Terraform state, by a plan to _create_ an `azuread_application_password` tied to that very same `azuread_application`:
```terraform
  # azuread_application_password.my_application will be created
  + resource "azuread_application_password" "my_application" {
      + application_id = "/applications/12345678-abcd-1234-1234-1234567890ab"
      + display_name   = (known after apply)
      + end_date       = "2099-01-01T01:02:03Z"
      + id             = (known after apply)
      + key_id         = (known after apply)
      + start_date     = (known after apply)
      + value          = (sensitive value)
    }
```
with `terraform apply` run log:
```
module.bgr.azuread_application_password.main: Creating...
module.bgr.azuread_application_password.main: Creation complete after 6s [id=12345678-abcd-1234-1234-1234567890ab/password/87654321-abcd-1234-1234-ba0987654321]
```

This is corroborated by looking at the Terraform statefile for a Terraform state where we did _not_ bump to `azuread` `3.1.0`, but are still on `3.0.2`.
In that state, I was able to verify that the `password` of the `azuread_application` has the same `key_id` as the separate `azuread_application_password` resource. Neither the `azuread_application` nor the `azuread_application_password` resource config here has been touched since before the password block was released in [2.53.0](https://github.com/hashicorp/terraform-provider-azuread/releases/tag/v2.53.0).
```fish
$ terraform show -json | jq '.values.root_module | ((.resources[] | select(.address == "azuread_application.my_other_application") | [{address, values: .values | {id, password}}]) + (.resources[] | select(.address == "azuread_application_password.my_other_application") | [{address, values: .values | {application_id, id, key_id}}]))'
[
  {
    "address": "azuread_application.my_other_application",
    "values": {
      "id": "/applications/34567890-abcd-1234-1234-1234567890ab",
      "password": [
        {
          "display_name": "terraform managed",
          "end_date": "2025-03-30T09:00:00Z",
          "key_id": "567890ab-abcd-1234-1234-1234567890ab",
          "start_date": "2024-04-03T11:30:18.4182226Z",
          "value": ""
        }
      ]
    }
  },
  {
    "address": "azuread_application_password.my_other_application",
    "values": {
      "application_id": "/applications/34567890-abcd-1234-1234-1234567890ab",
      "id": "34567890-abcd-1234-1234-1234567890ab/password/567890ab-abcd-1234-1234-1234567890ab",
      "key_id": "567890ab-abcd-1234-1234-1234567890ab"
    }
  }
]
```


> 
> I will try to reproduce the issue to check why that happen.
> 
> What I can tell you at the moment is, when you create the application with the latest release [release v3.1.0](https://github.com/hashicorp/terraform-provider-azuread/releases/tag/v3.1.0) and do a `plan` after the apply you don't see any changes.
> 
> Update: I cant reproduce the issue when I update from `2.5.3` to `3.1.0`.

For the record, I tried my best to reproduce this from scratch myself, using only an `azuread_application` resource and a `azuread_application_password`, but was unable to. I tried bumping from azuread versions `2.14.0` to `2.52.0` to `2.53.0` to `3.0.2` to `3.1.0`, but I couldn't reproduce the unexpected Terraform plan.